web/app/controllers/tracks_controller.rb

  def index
    @tracks = Track.order(created_at: :desc)
---
SELECT "tracks".* FROM "tracks" ORDER BY "tracks"."created_at" DESC

  def create
    uploaded = params[:track][:file]
    return redirect_to new_track_path, alert: "Please select a file." unless uploaded

    filename = uploaded.original_filename
    dest = File.join(Rails.application.config.demucs_input_path, filename)
    FileUtils.mkdir_p(Rails.application.config.demucs_input_path)
    File.binwrite(dest, uploaded.read)

    @track = Track.new(
      name: params[:track][:name].presence || File.basename(filename, File.extname(filename)),
      filename: filename
    )

    if @track.save
---
INSERT INTO "tracks" ("name", "filename", "status", "created_at", "updated_at") VALUES ('Shimmy-SommerSons-Vocals', 'Shimmy-SommerSons-Vocals.wav', 'pending', '2026-03-02 04:56:45.228648', '2026-03-02 04:56:45.228648') RETURNING "id"

  def set_track
    @track = Track.find(params[:id])
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = 1 LIMIT 1