web/app/jobs/process_track_job.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = 1 LIMIT 1
UPDATE "tracks" SET "status" = 'processing', "updated_at" = '2026-03-02 04:56:45.260954' WHERE "tracks"."id" = 1
---
  def perform(track_id)
    track = Track.find(track_id)
    track.update!(status: "processing", progress: 0)